// Напишите цикл, который пинимает на вход два числа(А и В) и
//возводит чисо А в натуральную степень В
Console.WriteLine('Введите Ваше число');

